groups = [
  {
    name: '筋肉モンスターの集会所',
    description: <<~EOS,
      トレーニングが好きで本気でトレーニングに打ち込みたい人は大歓迎です。みんなで有益な情報をやりとりしたり、たまには集まって一緒にトレーニングをしましょう！

      毎月29日19:00~20:30にシルバーマンジムに集まって一緒に筋トレをしたり、筋トレについての談義をしています。
      新規メンバーも募集しているのでグループチャットで詳しい話をしましょう！
    EOS
    is_public: true,
    tags: '',
  },
  {
    name: '渋谷でやるITエンジニア達の筋活！',
    description: <<~EOS,
      いろんな会社のエンジニアと開発ではなく筋トレを元に繋がってみようという考えから発足したグループです。

      別枠開催でエンジニア達が自社の総合職も誘ってイベントに参加する会を設けることも考えています。
      他社の別業種と関わる機会を筋トレを元に作ってみる。エンジニアというインドアそうな人達から筋トレというアウトドアっぽい取り組みに誘うことによって、今までと違った切り口からコミュニケーションを取りたいと思います。
      それによって今まで以上に見識と交友を広げましょう！
    EOS
    is_public: true,
    tags: '',
  },
  {
    name: 'カフェ・ワークアウトクオリティ',
    description: <<~EOS,
    カフェ・マッスルクオリティは、筋トレに関わることなら何をテーマにしても良い勉強会です。 2012年に始まり、ほぼ毎月1回、木曜の夜に開催しております。 参加者も、トーカーも、対象はあえて定めておらず、若手からベテランまで、楽しんで参加していただける勉強会です。 また、トークの形式は、講義形式だったり、ワークショップだったり、トーカーの課題を参加者で討議したりと、自由に選べます。 というのも、トーカーは講師としてではなく、参加者も受講生としてではなく、共に参加していただき、両者が、何らかの気付きを持ち帰ることを目指しているからです。
    EOS
    is_public: true,
    tags: '',
  },
  {
    name: '筋トレ勉強宴会',
    description: <<~EOS,
      筋トレ勉強宴会は、バルクアップを主体とした大会向けトレーニングの実践者が集まっている勉強会です。

      筋トレ勉強宴会の趣旨などは正式WEBサイトをご覧下さい。過去の様子はブログをご覧下さい。詳細に記述されています。 ごく一部は動画でも公開しています。 面白そうなテーマがあればぜひ読んで雰囲気を味わってください。
      このサービスの登録者のみしか参加できません。


      # 初めての方へ
      過去何度もイベントが開催されていて、第ｘｘ回という数字をつけていますが連続性のあるイベントではありませんので安心してご参加下さい。

      毎回20名程度のうち半数程度が初参加者です！


      # 筋トレ勉強宴会ですがお酒を飲まれなくても大丈夫です
      この勉強会の特徴は宴会で議論することで本当の自分の知識として定着させることです。分からなかった事、面白かったこと、疑問点などどんな事でも懇親会で周りの方とお話して下さい。話しかけるのが苦手な方は幹事（田中・近藤・三鷹）にお声をかけて隣に座ってください。


      # メディア掲載など
      当グループブログに写真や動画などを掲載させていただきます。その際、お顔が写り込んでしまう場合がありますがご了承ください。
    EOS
    is_public: true,
    tags: '',
  },
  {
    name: 'Workout ZoomUP',
    description: <<~EOS,
      Workout ZoomUPは筋トレをしている人、したい人たちが集まって、知識を共有したり質問をしたりするオンライン勉強会です。筋トレをしている人、筋トレに興味がある人なら、知識の量や技術の有無に関係なく、誰でも参加することができます。

      月に2回の開催で、「セッション回」と「座談会」を一度ずつ開催します。

      「セッション回」では、毎回テーマを設定して、その道のスペシャリストを招いて話してもらったり、参加者の有志が研究結果を発表したりします。その後、関連する内容についてワイワイ話し合ったり質問できる時間を作ります。

      「座談会」は、Q&A、雑談のためのゆるっとした形で進めていこうと思います。

      Workout ZoomUPが始まった経緯については、「オンライン勉強会 Workout ZoomUP」をお読みください。
    EOS
    is_public: true,
    tags: '',
  },
  {
    name: 'WorkoutGirls Japan',
    description: <<~EOS,
      # WorkoutGirls Japan は女性のチャレンジを応援するコミュニティ
      ## WorkoutGirls Japan って？
      WorkoutGirls Japan は、女性を対象に筋トレの体験と学ぶ機会を提供している国際的なコミュニティです。筋トレの楽しさ、美しさを、多くの女性たちに届けることを目的とし、1-Day Workshopを開催しています。各国言語に訳されたチュートリアルを題材に、世界各地でワークショップが開かれています。

      ### 1-Day Workshop とは？
      はじめての筋トレをしようをテーマに行っている、女性向けの1-dayワークショップです。 ワークショップでは、少人数のグループにわかれて課題にとりくみます。体を動かしながら実際に筋トレを行って、筋トレの基礎を学びます。女性が気軽な雰囲気で自分らしく楽しく学べるワークショップです。
      日本では、これまで東京で４回開催、今年は横浜・会津若松で初開催しました。 東京以外の都市でワークショップを開催したい方がいれば、ご連絡ください。相談・協力します。
      前回のワークショップ開催案内はコチラ

      ### 毎月勉強会を開催
      1日のワークショップだけでは物足りない。もっと筋トレをやってみたい！
      自分ひとりでも筋トレをできるようになりたい！筋トレについてもっと勉強したい！筋トレをしてもっと綺麗になりたい！
      ワークショップでコーチ・メンターができるようになりたい！...
      という方は、毎月開催している勉強会に是非ご参加ください。
      女性はどなたでも参加いただけます。
      筋トレ入門者や初体験な方、大歓迎！
      筋トレを共に学ぶ仲間と、経験豊富なコーチたちとの出会いは、あなたの学びたい・綺麗になりたい意欲を後押しします。

      ## コーチ＆メンター募集中
      筋トレについて知っている方は、ワークショップや勉強会でコーチとして参加しませんか？ 性別関係なく募集します！
      一人で教えることに不安がある方は、コーチのサポート役であるメンターとしてチャレンジしてみましょう！ 教えることで、自分の知識や経験を深めることができます。参加者やコーチから学ぶことも多いですよ。

      ## Slackに参加しよう
      コチラ からWorkoutGirls JapanのSlack（チャット）に参加してください。メールアドレスを入力すると、Slackへの招待メールが届きます。運営メンバーやコーチ、これまでのワークショップ参加者が、Slackに参加しています。

      # Q&A
      ### WorkoutGirlsのワークショップに参加しました。勉強会にも参加していいですか？
      もちろんです！
      ワークショップでやったチュートリアルを、もう一度一緒にやってみましょう。
      知識が増え、筋トレの経験も増えたら、応用して、あなたオリジナルのメニューをつくってみましょう。

      ### WorkoutGirlsのワークショップに参加していません。参加しても大丈夫でしょうか？
      もちろんです！
      ゼロからのスタートでも、チュートリアルにそって筋トレをしてみましょう。
      筋トレ初心者の方、筋肉について勉強したい方にもオススメです。

      ### 筋トレの知識は必要ですか？
      ワークショップや勉強会は、入門者＆初心者向けです。筋トレの経験や知識は一切必要ありません。やってみたいという気持ちがあれば大丈夫です！もし、基礎知識があれば学びの助けになるかもしれませんが、必須ではありません。

      ### 持ち物は必要ですか？
      運動できる服装、靴、ドリンクなどはご自身でご準備ください。

      ### 女性ではありません。参加することはできますか？
      ワークショップと勉強会の対象者は女性のみに限定しています。ご理解ください。
      なお、コーチ・スタッフの性別は問いません。
    EOS
    is_public: true,
    tags: '',
  },
  {
    name: '筋トレ × 家事育児',
    description: <<~EOS,
      とあるイベントで出会った筋トレ・筋肉に関係する業界で働くママ達。
      家事ネタ、育児ネタ、筋トレネタで盛り上がり、
      もっともっと似た環境の方と交流したいなぁ
      と思い、こんなグループを作成しました！
    EOS
    is_public: true,
    tags: '',
  },
  {
    name: '関西筋トレ女子',
    description: <<~EOS,
      「勉強会に行ってみたいけど参加者が男性ばかりだとちょっと行く勇気が出ない」 「初心者なのでついていけるか心配」という女性の方、お気軽にご参加ください。

      少ない(と世間では言われている)女子トレーニーのよい交流の場にできればと思います。
      ※女性限定勉強会です。恐れ入りますが男性の方はご遠慮ください。
    EOS
    is_public: true,
    tags: '',
  },
  {
    name: '高校生のための筋トレ勉強会teens',
    description: <<~EOS,
      ・2019年9月に誕生しました！！

      ・高校生でも積極的に情報技術に触れ、お互いで情報交換をすることでお互いのレベルも上がっていくはずです！！

      これから色々イベントを運営し、関西から高校生の可能性を追求します！！

      ビジョン

      気軽に相談できる関係構築

      高校生の筋トレ向上
    EOS
    is_public: true,
    tags: '',
  },
  {
    name: 'トレーニング教科書',
    description: <<~EOS,
      このグループは、
      ・トレーニング解説
      ・ストレッチ、コンディショニング方法
      を、ブログ、YouTubeで配信していて、グループとして知識共有や運営をしようと思い立ち上げました。

      トレーニング解説をしていますが、
      ボディコンテストや、筋肥大について解説しているわけではありません。
      骨格からみたトレーニング方法やフォームであったり「怪我をせず、健康に強く」がテーマです。

      ブログも是非チェックしてみてください！！
      http://localhost:8080/user_blogs


      ＊このブログ、チャンネルは、自分自身が勉強し共有しようと思い、立ち上げたものなので、間違った理解や表現が含まれる可能性があります。このブログにおいて起こった一切のトラブルに関して、責任は負い兼ねますのでご了承下さい。
      骨格等、様々な個人差はありますが、知りうる限りの正確かつ有益な情報を提供していきたいと思ってますので、よろしくお願いします。
    EOS
    is_public: true,
    tags: '',
  },
]

groups.each do |val|
  group = Group.create(val)
  p "create group: #{group.id}"
end
